tap "homebrew/cask"
tap "homebrew/cask-fonts"
cask_args appdir: "/Applications"

brew "bat"
brew "exa"
brew "fd"
brew "fish"
brew "fzf"
brew "hugo"
brew "lv"
brew "mas"
brew "nkf"
brew "node"
brew "peco"
brew "poetry"
brew "procs"
brew "python"
brew "rename"
brew "ripgrep"
brew "sshuttle"
brew "tmux"
brew "tokei"

cask "alfred"
cask "alt-tab"
cask "bettertouchtool"
cask "charles"
cask "chromedriver"
cask "cmd-eikana"
cask "dropbox"
cask "firefox"
cask "font-hackgen-nerd"
cask "google-chrome"
cask "gpg-suite"
cask "grammarly"
cask "iterm2"
cask "loopback"
cask "mactex-no-gui"
cask "mendeley"
cask "microsoft-edge"
cask "obs"
cask "onyx"
cask "r"
cask "resolutionator"
cask "skim"
cask "slack"
cask "visual-studio-code"
cask "vivaldi"
cask "webex-meetings"
cask "zoom"

# App Store applications
mas "1Password", id: 443987910
mas "CotEditor", id: 1024640650
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Logic Pro X", id: 634148309
mas "MainStage 3", id: 634159523
mas "Messenger", id: 1480068668
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "OmniFocus", id: 867299399
mas "OmniGraffle", id: 1142578753
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
